#coding=utf-8
# 導入excel管理
from Excel_Section import excel_Manage as EM
#=================================================================
#宣告變數
#=================================================================
# 要求區域
require_area = ['台中-中港','中彰','雲彰','彰化','彰濱']

# 檔案名稱
file_name = '110年06~110年07'

# 要求時間
require_date =[
    '110-06-15',
'110-06-15',
'110-06-16',
'110-06-16',
'110-06-17',
'110-06-17',
'110-06-18',
'110-06-18',
'110-06-19',
'110-06-19',
'110-06-21',
'110-06-21',
'110-06-22',
'110-06-22',
'110-06-23',
'110-06-23',
'110-06-24',
'110-06-24',
'110-06-25',
'110-06-25',
]
# 要求門市
require_store  = [
['台紙~豐肚~一勝~親旺~王田'],
['大肚~蔗園~遊園~中蔗'],
['桂花~鹿和~鹿~鹿港'],
['風車~創新~東崎~鹿正'],
['鹿慶~頂番~頂王~鹿寶~鹿棋'],
['鳴人~禾群~伸東~巨航'],
['海德堡~新豐功~鑫讚~向權'],
['新墩興~南屯~豐春~墩南'],
['鹿秀~鹿工~鹿濱~線西'],
['禾順~伸濱~伸冠~伸港'],
['向上~豐河~惠文~惠中~瑞陽'],
['興春~向心~文豐~墩正'],
['鄉林~墩業~昌進~墩富'],
['惠宇~大進~熊貓~豐釆'],
['大立光~鑫大立~精科~富亦'],
['黎明東~鑫權勝~權旺~鑫文山'],
['嶺中~新春社~春安~文嶺'],
['嶺寶~詠豐~哈魚~萬文'],
['上楓樹~工權~工站~中勇'],
['權興~聚懋~精田~精站~墩陽']
]

# 執行
# 可把excel的資料擺在同一行
EM.do_excel(require_area[1],file_name,require_date,require_store,('A2','A207','C2','C207'))

